IDENTIFICATION DIVISION. *> Compile and run with cobc -std=cobol2014 --free -x day1.cbl -j
PROGRAM-ID. DAY1.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DAY1DATA ASSIGN TO INPUT
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD DAY1DATA.
    01 ENTRY.
        05 LEFTC PIC 9(1).
        05 SPC PIC X(3).
        05 RIGHTC PIC 9(1).

WORKING-STORAGE SECTION.
    01 WS-ENTRY.
        05 WS-LEFTC PIC 9(1).
        05 WS-SPC PIC X(3).
        05 WS-RIGHTC PIC 9(1).
    77 WS-EOF PIC A(1).


PROCEDURE DIVISION.
    MOVE ZEROS TO WS-ENTRY.
    MOVE 'N' TO WS-EOF.
    OPEN INPUT DAY1DATA.
        PERFORM UNTIL WS-EOF='Y'
            READ DAY1DATA
                AT END MOVE 'Y' TO WS-EOF
                NOT AT END
                DISPLAY LEFTC
            END-READ
        END-PERFORM.
    CLOSE DAY1DATA.
    STOP RUN.
